reference/gpg.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GNU Privacy Guard (GPG) reference</title>
<meta property="og:title" content="GNU Privacy Guard (GPG) reference" />
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="org-div-home-and-up">
  <a accesskey="u" href="index.html">Up</a> | <a accesskey="h" href="../index.html">Home</a>
</div><div id="content" class="content">
<h1 class="title">GNU Privacy Guard (GPG) reference</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#creating-new-keys">1. Creating new keys</a></li>
<li><a href="#listing-keys">2. Listing keys</a></li>
<li><a href="#exporting-keys">3. Exporting keys</a></li>
<li><a href="#importing-keys">4. Importing keys</a></li>
<li><a href="#changing-the-trust-level-of-keys">5. Changing the trust level of keys</a></li>
<li><a href="#git-integration-with-gpg">6. Git integration with GPG</a></li>
</ul>
</div>
</div>

<div id="outline-container-creating-new-keys" class="outline-2">
<h2 id="creating-new-keys"><span class="section-number-2">1.</span> Creating new keys</h2>
<div class="outline-text-2" id="text-creating-new-keys">
<p>
The following command can be used to create a new key interactively. See <a href="https://www.linuxbabe.com/security/a-practical-guide-to-gpg-part-1-generate-your-keypair">this
article</a> for more information.
</p>

<div class="org-src-container">
<pre class="src src-bash">gpg --full-generate-key
<span style="color: #595959;"># </span><span style="color: #595959;">...</span>
<span style="color: #595959;">#</span>
<span style="color: #595959;"># </span><span style="color: #595959;">Please select what kind of key you want:</span>
<span style="color: #595959;">#    </span><span style="color: #595959;">(1) RSA and RSA</span>
<span style="color: #595959;">#    </span><span style="color: #595959;">(2) DSA and Elgamal</span>
<span style="color: #595959;">#    </span><span style="color: #595959;">(3) DSA (sign only)</span>
<span style="color: #595959;">#    </span><span style="color: #595959;">(4) RSA (sign only)</span>
<span style="color: #595959;">#    </span><span style="color: #595959;">(9) ECC (sign and encrypt) *default*</span>
<span style="color: #595959;">#   </span><span style="color: #595959;">(10) ECC (sign only)</span>
<span style="color: #595959;">#   </span><span style="color: #595959;">(14) Existing key from card</span>
<span style="color: #595959;"># </span><span style="color: #595959;">Your selection? 1</span>
<span style="color: #595959;"># </span><span style="color: #595959;">RSA keys may be between 1024 and 4096 bits long.</span>
<span style="color: #595959;"># </span><span style="color: #595959;">What keysize do you want? (3072) 4096</span>
<span style="color: #595959;"># </span><span style="color: #595959;">Requested keysize is 4096 bits</span>
<span style="color: #595959;"># </span><span style="color: #595959;">Please specify how long the key should be valid.</span>
<span style="color: #595959;">#          </span><span style="color: #595959;">0 = key does not expire</span>
<span style="color: #595959;">#       </span><span style="color: #595959;">&lt;n&gt;  = key expires in n days</span>
<span style="color: #595959;">#       </span><span style="color: #595959;">&lt;n&gt;w = key expires in n weeks</span>
<span style="color: #595959;">#       </span><span style="color: #595959;">&lt;n&gt;m = key expires in n months</span>
<span style="color: #595959;">#       </span><span style="color: #595959;">&lt;n&gt;y = key expires in n years</span>
<span style="color: #595959;"># </span><span style="color: #595959;">Key is valid for? (0) 0</span>
<span style="color: #595959;"># </span><span style="color: #595959;">Key does not expire at all</span>
<span style="color: #595959;"># </span><span style="color: #595959;">Is this correct? (y/N) y</span>
<span style="color: #595959;">#</span>
<span style="color: #595959;"># </span><span style="color: #595959;">...</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-listing-keys" class="outline-2">
<h2 id="listing-keys"><span class="section-number-2">2.</span> Listing keys</h2>
<div class="outline-text-2" id="text-listing-keys">
<p>
The following command can be used to list the private keys on your machine.
</p>

<div class="org-src-container">
<pre class="src src-bash">gpg --list-secret-keys
</pre>
</div>

<p>
By adding the following option, the command will use the key format expected by
Git (the <code>XXX</code> part will be needed in <a href="#git-integration-with-gpg">Git integration</a>).
</p>

<div class="org-src-container">
<pre class="src src-bash">gpg --list-secret-keys --keyid-format=long

<span style="color: #595959;"># </span><span style="color: #595959;">[keyboxd]</span>
<span style="color: #595959;"># </span><span style="color: #595959;">---------</span>
<span style="color: #595959;"># </span><span style="color: #595959;">sec   ed25519/</span><span style="color: #972500; font-weight: bold;">XXXXXXXXXXXXXXXX</span><span style="color: #595959;"> 2024-03-29 [SC] [expires: 2027-03-29]</span>
<span style="color: #595959;">#       </span><span style="color: #595959;">YYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY</span>
<span style="color: #595959;"># </span><span style="color: #595959;">uid                 [ultimate] Foo Bar <a href="mailto:foo.bar%40example.com">&lt;foo.bar@example.com&gt;</a></span>
<span style="color: #595959;"># </span><span style="color: #595959;">ssb   cv25519/ZZZZZZZZZZZZZZZZ 2024-03-29 [E]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-exporting-keys" class="outline-2">
<h2 id="exporting-keys"><span class="section-number-2">3.</span> Exporting keys</h2>
<div class="outline-text-2" id="text-exporting-keys">
<p>
See this <a href="https://unix.stackexchange.com/a/482559/526380">StackOverflow answer</a> for more information on these commands.
</p>

<p>
The following command will export an ASCII-armored version of the <i>public</i> key.
</p>

<div class="org-src-container">
<pre class="src src-bash">gpg --output public.pgp <span style="color: #005e8b;">\</span>
    --armor             <span style="color: #005e8b;">\</span>
    --export            <span style="color: #005e8b;">\</span>
    <span style="color: #005e8b;">'foo.bar@example.com'</span>
</pre>
</div>

<p>
The following command will export an ASCII-armored version of the <i>secret</i>
(i.e. private) key.
</p>

<div class="org-src-container">
<pre class="src src-bash">gpg --output private.pgp <span style="color: #005e8b;">\</span>
    --armor              <span style="color: #005e8b;">\</span>
    --export-secret-key  <span style="color: #005e8b;">\</span>
    <span style="color: #005e8b;">'foo.bar@example.com'</span>
</pre>
</div>

<p>
If it&rsquo;s a backup, the following should be used.
</p>

<div class="org-src-container">
<pre class="src src-bash">gpg --output backup.pgp            <span style="color: #005e8b;">\</span>
    --armor                        <span style="color: #005e8b;">\</span>
    --export-secret-keys           <span style="color: #005e8b;">\</span>
    --export-options export-backup <span style="color: #005e8b;">\</span>
    <span style="color: #005e8b;">'foo.bar@example.com'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-importing-keys" class="outline-2">
<h2 id="importing-keys"><span class="section-number-2">4.</span> Importing keys</h2>
<div class="outline-text-2" id="text-importing-keys">
<p>
A previously-exported backup key can be imported with the following command.
</p>

<div class="org-src-container">
<pre class="src src-bash">gpg --import backup.gpg
</pre>
</div>

<p>
The following should be better, but it failed for me on Gentoo, while the
previous worked fine.
</p>

<div class="org-src-container">
<pre class="src src-bash">gpg --import-options restore <span style="color: #005e8b;">\</span>
    --import                 <span style="color: #005e8b;">\</span>
    backup.pgp
</pre>
</div>
</div>
</div>

<div id="outline-container-changing-the-trust-level-of-keys" class="outline-2">
<h2 id="changing-the-trust-level-of-keys"><span class="section-number-2">5.</span> Changing the trust level of keys</h2>
<div class="outline-text-2" id="text-changing-the-trust-level-of-keys">
<p>
The trust level of a key is displayed between square brackets when <a href="#listing-keys">listing
them</a>. This trust level can be changed with the following command.
</p>

<div class="org-src-container">
<pre class="src src-bash">$ gpg --edit-key <span style="color: #005e8b;">'foo.bar@example.com'</span>
<span style="color: #595959;"># </span><span style="color: #595959;">...</span>
gpg&gt; trust
<span style="color: #595959;"># </span><span style="color: #595959;">Please decide how far you trust this user to correctly verify other users' keys</span>
<span style="color: #595959;"># </span><span style="color: #595959;">(by looking at passports, checking fingerprints from different sources, etc.)</span>
<span style="color: #595959;">#</span>
<span style="color: #595959;">#   </span><span style="color: #595959;">1 = I don't know or won't say</span>
<span style="color: #595959;">#   </span><span style="color: #595959;">2 = I do NOT trust</span>
<span style="color: #595959;">#   </span><span style="color: #595959;">3 = I trust marginally</span>
<span style="color: #595959;">#   </span><span style="color: #595959;">4 = I trust fully</span>
<span style="color: #595959;">#   </span><span style="color: #595959;">5 = I trust ultimately</span>
<span style="color: #595959;">#   </span><span style="color: #595959;">m = back to the main menu</span>
<span style="color: #595959;">#</span>
<span style="color: #595959;"># </span><span style="color: #595959;">Your decision?</span>
gpg&gt; <span style="color: #2a5045;">5</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-git-integration-with-gpg" class="outline-2">
<h2 id="git-integration-with-gpg"><span class="section-number-2">6.</span> Git integration with GPG</h2>
<div class="outline-text-2" id="text-git-integration-with-gpg">
<p>
The following shows how to add a PGP key to Git, and how to enable commit
signing by default. Note that this command enables this settings globally, but
they can also be set in the current repository by removing the <code>--global</code> flag.
</p>

<p>
The <code>XXX</code> part is supposed to be the key shown in <a href="#listing-keys">Listing</a>.
</p>

<div class="org-src-container">
<pre class="src src-bash">git config --global user.signingkey <span style="color: #005e8b;">"</span><span style="color: #972500; font-weight: bold;">XXXXXXXXXXXXXXXX</span><span style="color: #005e8b;">"</span>
git config --global commit.gpgsign true
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
